---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontLeftAndRight
enum: Autodesk.Revit.DB.Architecture.TreadNosingPosition
source: html/4eabcfcb-1df9-3eec-d78e-5306b3f712e2.htm
---
# Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontLeftAndRight

Adds nosing on the front left and left edge of tread.